Tekla Open API Reference for Tekla Structures 2025
DrawingHandler Constructor
 Creates a new drawing handler instance, a "handle" to Tekla.Structures.Drawing. When a drawing handler object is created, it is possible to ask the current active drawing in Tekla Structures, get a list of drawings or create a new drawing.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DrawingHandler()
Public Sub New
See Also
Reference
DrawingHandler Class
Tekla.Structures.Drawing Namespace